#Завдання 3:

#3.1 Сценарій: Необхідно запланувати регулярні фонові завдання, такі як відправлення щотижневих електронних листів або генерація звітів опівночі.
Gem: 'whenever'

# Gem 'whenever' дозволяє вам налаштувати і автоматизувати регулярні фонові завдання на основі cron job (планувальник завдань).
# Це дозволить, наприклад, налаштувати відправлення листів або генерацію звітів по розкладу.

#3.2 Ваш веб-додаток потребує безпечного управління завантаженням файлів, включаючи зображення та документи, і можливо зберігати їх у хмарному сервісі.
Gem: 'carrierwave'

# 'carrierwave' дозволяє легко завантажувати і зберігати файли, зокрема зображення та документи.
# Крім того, він має підтримку хмарних сервісів (наприклад, Amazon S3) для зберігання файлів.

#3.3 Ваш веб-сайт містить розділ з великою кількістю статей, наприклад, блог або новинний портал. З часом кількість статей зросла до сотень або навіть тисяч, і відвідувачам сайту стає важко знайти потрібну інформацію. Вам потрібен ефективний спосіб організувати показ цих статей, щоб користувачі могли легко переглядати їх, не загрузнувши у великій кількості контенту на одній сторінці.
Gem: 'kaminari'

# 'kaminari' дозволяє ефективно пагінувати (ділити на сторінки) великі обсяги контенту на сайті, зокрема для блогів або новинних порталів.
# Він дає можливість користувачам переглядати статті сторінками, не завантажуючи всю інформацію за один раз.